app/controllers/words_controller.rb

SELECT  "words".* FROM "words" WHERE "words"."name" = ? LIMIT ?  [["name", "dog"], ["LIMIT", 1]]
---
    def show
    word=Word.find_by(name: param[:name])