app/controllers/words_controller.rb

     def create
        word=Word.create(word_params)
---
INSERT INTO "words" ("name", "imgurl", "definition", "example", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def my_words
        words=User.find(params[:id]).words
---
SELECT "words".* FROM "words" WHERE "words"."user_id" = ?  [["user_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def show
    word=Word.find(params[:id])
---
SELECT  "words".* FROM "words" WHERE "words"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]

    def index
    words=Word.all
---
SELECT "words".* FROM "words"

    def destroy
    Word.delete(params[:id])
---
DELETE FROM "words" WHERE "words"."id" = ?  [["id", 29]]